<?php
ini_set('display_errors', '1');
ini_set('display_startup_errors', '1');
ini_set('error_reporting', E_ALL);
//header('Content-type: text/plain; charset=UTF-8');
//setlocale(LC_ALL, 'ru_RU.65001', 'rus_RUS.65001', 'Russian_Russia. 65001', 'russian');

require_once "../parsencat.php";
require_once "../jbdump.php";
require_once "../fw.joomla.php";

$brand = 6;
$brandName = "tvoe";
$host = "http://tvoe.ru";

$pol_ar = array(
	'Мужская коллекция' => 81,
	'Женская коллекция' => 80,
	'Детская коллекция' => 82,

	'Size+' => 80,
	'Для женщин' => 80,
	'Для мужчин' => 81,
	'Для детей' => 82,
);

$polmzhd_ar = array(
	'Мужская одежда' => 1231,
	'Женская одежда' => 1232,
	'Детская одежда' => 1233,
);

$vidv_ar = array(
'Женщины - Одежда - Верхняя одежда' => ,
'Женщины - Одежда - Вязаный трикотаж' => ,
'Женщины - Одежда - Джемпер' => ,
'Женщины - Одежда - Кардиган' => ,
'Женщины - Одежда - Водолазка' => ,
'Женщины - Одежда - Толстовка/Свитшот' => ,
'Женщины - Одежда - Блузка/Рубашка' => ,
'Женщины - Одежда - Поло' => ,
'Женщины - Одежда - Футболка' => ,
'Женщины - Одежда - Футболка (без принта)' => ,
'Женщины - Одежда - Майка' => ,
'Женщины - Одежда - Майка (без принта)' => ,
'Женщины - Одежда - Топ' => ,
'Женщины - Одежда - Платье' => ,
'Женщины - Одежда - Юбка' => ,
'Женщины - Одежда - Брюки' => ,
'Женщины - Одежда - Джинсы' => ,
'Женщины - Одежда - Леггинсы/Бриджи' => ,
'Женщины - Одежда - Шорты' => ,
'Женщины - Одежда - Комбинезон' => ,
'Женщины - Одежда - Пижама/Ночная сорочка' => ,
'Женщины - Одежда - Халат' => ,
'Женщины - Одежда - Трусы' => ,
'Женщины - Одежда - Носки/Следки' => ,
'Женщины - Одежда - Новогодняя коллекция 2016' => ,
'Женщины - Одежда - ТВОЕ + Звездные войны' => ,
'Женщины - Белье - Бюстгальтер' => ,
'Женщины - Белье - Трусы' => ,
'Женщины - Белье - Колготки' => ,
'Женщины - Белье - Носки/Следки' => ,
'Женщины - Белье - Гольфы' => ,
'Женщины - Обувь - Кеды' => ,
'Женщины - Обувь - Сапоги' => ,
'Женщины - Обувь - Тапочки' => ,
'Женщины - Аксессуары - Шапки/шарфы/перчатки' => ,
'Женщины - Аксессуары - Бейсболка' => ,
'Женщины - Аксессуары - Шарф/Платок' => ,
'Женщины - Аксессуары - Варежки' => ,

'Мужчины - Одежда - Вязаный трикотаж' => ,
'Мужчины - Одежда - Джемпер' => ,
'Мужчины - Одежда - Водолазка' => ,
'Мужчины - Одежда - Толстовка' => ,
'Мужчины - Одежда - Рубашка/Сорочка' => ,
'Мужчины - Одежда - Поло' => ,
'Мужчины - Одежда - Футболка' => ,
'Мужчины - Одежда - Футболка (без принта)' => ,
'Мужчины - Одежда - Майка (без принта)' => ,
'Мужчины - Одежда - Брюки/Джинсы' => ,
'Мужчины - Одежда - Шорты' => ,
'Мужчины - Одежда - Трусы' => ,
'Мужчины - Одежда - Носки/Следки' => ,
'Мужчины - Одежда - Новогодняя коллекция 2016' => ,
'Мужчины - Одежда - ТВОЕ + Звездные войны' => ,
'Мужчины - Одежда - TBOE + Batman' => ,
'Мужчины - Белье - Трусы' => ,
'Мужчины - Белье - Носки/Следки' => ,
'Мужчины - Аксессуары - Шапки/шарфы/перчатки' => ,
'Мужчины - Аксессуары - Бейсболка' => ,

'Дети - Девочки 0-2 - Верхняя одежда' => ,
'Дети - Девочки 0-2 - Шапки/шарфы/ варежки/перчатки' => ,
'Дети - Девочки 0-2 - Вязаный трикотаж' => ,
'Дети - Девочки 0-2 - Джемпер' => ,
'Дети - Девочки 0-2 - Блузка/Рубашка' => ,
'Дети - Девочки 0-2 - Футболка' => ,
'Дети - Девочки 0-2 - Боди' => ,
'Дети - Девочки 0-2 - Брюки' => ,
'Дети - Девочки 0-2 - Леггинсы/Бриджи' => ,
'Дети - Девочки 0-2 - Колготки' => ,
'Дети - Девочки 0-2 - Носки/Следки' => ,
'Дети - Девочки 2-8 - ТВОЕ + Звездные войны' => ,
'Дети - Девочки 2-8 - Шапки/шарфы/ варежки/перчатки' => ,
'Дети - Девочки 2-8 - Вязаный трикотаж' => ,
'Дети - Девочки 2-8 - Джемпер' => ,
'Дети - Девочки 2-8 - Кардиган' => ,
'Дети - Девочки 2-8 - Футболка' => ,
'Дети - Девочки 2-8 - Майка' => ,
'Дети - Девочки 2-8 - Платье' => ,
'Дети - Девочки 2-8 - Пижама/Ночная сорочка' => ,
'Дети - Девочки 2-8 - Леггинсы/Бриджи' => ,
'Дети - Девочки 2-8 - Топ/Белье' => ,
'Дети - Девочки 2-8 - Трусы' => ,
'Дети - Девочки 2-8 - Колготки' => ,
'Дети - Девочки 2-8 - Носки/Следки' => ,
'Дети - Девочки 2-8 - Сумка' => ,
'Дети - Девочки 8-13 - ТВОЕ + Звездные войны' => ,
'Дети - Девочки 8-13 - Верхняя одежда' => ,
'Дети - Девочки 8-13 - Шапки/шарфы/ варежки/перчатки' => ,
'Дети - Девочки 8-13 - Вязаный трикотаж' => ,
'Дети - Девочки 8-13 - Джемпер' => ,
'Дети - Девочки 8-13 - Кардиган' => ,
'Дети - Девочки 8-13 - Водолазка' => ,
'Дети - Девочки 8-13 - Блузка/Рубашка' => ,
'Дети - Девочки 8-13 - Поло' => ,
'Дети - Девочки 8-13 - Футболка' => ,
'Дети - Девочки 8-13 - Майка' => ,
'Дети - Девочки 8-13 - Платье' => ,
'Дети - Девочки 8-13 - Брюки' => ,
'Дети - Девочки 8-13 - Леггинсы/Бриджи' => ,
'Дети - Девочки 8-13 - Шорты' => ,
'Дети - Девочки 8-13 - Пижама/Ночная сорочка' => ,
'Дети - Девочки 8-13 - Топ/Белье' => ,
'Дети - Девочки 8-13 - Трусы' => ,
'Дети - Девочки 8-13 - Колготки' => ,
'Дети - Девочки 8-13 - Балетки' => ,
'Дети - Девочки 8-13 - Сумка' => ,

'Дети - Мальчики 0-2 - Верхняя одежда' => ,
'Дети - Мальчики 0-2 - Шапки/шарфы/ варежки/перчатки' => ,
'Дети - Мальчики 0-2 - Вязаный трикотаж' => ,
'Дети - Мальчики 0-2 - Джемпер' => ,
'Дети - Мальчики 0-2 - Жакет' => ,
'Дети - Мальчики 0-2 - Рубашка' => ,
'Дети - Мальчики 0-2 - Футболка' => ,
'Дети - Мальчики 0-2 - Боди' => ,
'Дети - Мальчики 0-2 - Пижама' => ,
'Дети - Мальчики 0-2 - Брюки' => ,
'Дети - Мальчики 0-2 - Колготки' => ,
'Дети - Мальчики 0-2 - Носки/Следки' => ,
'Дети - Мальчики 2-8 - ТВОЕ + Звездные войны' => ,
'Дети - Мальчики 2-8 - Шапки/шарфы/ варежки/перчатки' => ,
'Дети - Мальчики 2-8 - Вязаный трикотаж' => ,
'Дети - Мальчики 2-8 - Джемпер' => ,
'Дети - Мальчики 2-8 - Кардиган' => ,
'Дети - Мальчики 2-8 - Водолазка' => ,
'Дети - Мальчики 2-8 - Толстовка' => ,
'Дети - Мальчики 2-8 - Рубашка' => ,
'Дети - Мальчики 2-8 - Футболка' => ,
'Дети - Мальчики 2-8 - Пижама' => ,
'Дети - Мальчики 2-8 - Брюки' => ,
'Дети - Мальчики 2-8 - Шорты' => ,
'Дети - Мальчики 2-8 - Трусы' => ,
'Дети - Мальчики 2-8 - Сапоги' => ,
'Дети - Мальчики 8-13 - ТВОЕ + Звездные войны' => ,
'Дети - Мальчики 8-13 - Верхняя одежда' => ,
'Дети - Мальчики 8-13 - Шапки/шарфы/ варежки/перчатки' => ,
'Дети - Мальчики 8-13 - Вязаный трикотаж' => ,
'Дети - Мальчики 8-13 - Джемпер' => ,
'Дети - Мальчики 8-13 - Водолазка' => ,
'Дети - Мальчики 8-13 - Толстовка' => ,
'Дети - Мальчики 8-13 - Рубашка' => ,
'Дети - Мальчики 8-13 - Поло' => ,
'Дети - Мальчики 8-13 - Футболка' => ,
'Дети - Мальчики 8-13 - Майка' => ,
'Дети - Мальчики 8-13 - Брюки' => ,
'Дети - Мальчики 8-13 - Шорты' => ,
'Дети - Мальчики 8-13 - Носки/Следки' => ,
'Дети - Мальчики 8-13 - Сапоги' => ,

'Семья - Одежда для всей семьи - Звездные войны' => ,
'Семья - Одежда для всей семьи - ОДИНАКОВО ТВОЕ' => ,
'Семья - Одежда для всей семьи - Миньоны' => ,
'Семья - Одежда для всей семьи - Мстители' => ,
'Семья - Одежда для всей семьи - Adventure Time' => ,
'Семья - Одежда для всей семьи - Disney' => ,
'Семья - Одежда для всей семьи - Batman' => ,
'Семья - Одежда для всей семьи - Superman' => ,
'Семья - Одежда для всей семьи - Мумий Тролль' => ,
'Семья - Одежда для всей семьи - Хэллоуин' => ,
'Семья - Одежда для всей семьи - Одежда для собак' => ,

	'Трикотаж' => 92,
	'Платья' => 126,
	'Блузки' => 122,
	'Юбки' => 128,
	'Брюки' => 91,
	'Жакеты' => 124,
	'Топы' => 99,
	'Футболки' => 127,
	'Майки' => 125,
	'Белье' => 142,
	'Пляжная одежда' => 1394,
	'Аксессуары' => 1390,

	'Девочки' => 0,
	'Мальчики' => 0,
);

$counter = 0;
$catalog = json_decode(file_get_contents($brandName . ".json"));
//foreach ($catalog as $cat => &$items) {
foreach ($catalog as &$item) {
	//	foreach ($items as &$item) {
	// $pol = 0;
	$polmzhd = 0;

	$category = explode(" - ", $item->category);
	$pol = $pol_ar[$category[0]];
	// $vidv = $vidv_ar[$item->category];
	$vidv = $vidv_ar[$category[1]];

	$obj = new stdClass;
	$obj->nc_name = $item->name; // запись имя товара
	$obj->nc_brend = $brand; // запись бренд
	$obj->nc_pol = $pol; // запись коллекция
	// $obj->nc_polmzhd = $polmzhd; // запись пол
	$obj->nc_polmzhd = 0; // запись пол
	// $obj->nc_vidv = $vidv[$item->category]; // запись вид вещи
	// $obj->nc_vidv = 0; // запись вид вещи
	$obj->nc_vidv = $vidv; // запись вид вещи
	$obj->title = $obj->nc_name; // запись тайтл
	// $obj->nc_description = $item->desc; // запись описания
	$obj->nc_sku = $item->sku; // запись артикул
	$obj->alias = parsef::translit(trim($item->name)); // запись алиас
	$obj->nc_photo = $item->pict; // запись картинки
	$obj->nc_src = $item->link; // запись источник
	$obj->nc_crc = crc32($item->link); // запись id источника
	
	if ($item->desc) {
	  $obj->nc_description = "<ul>";
	  foreach ($item->desc as $dVal) {
	    $obj->nc_description .= "<li>{$dVal}</li>";
	  }
	  $obj->nc_description .= "</ul>";
	}

	// $obj->nc_description = ""; // запись описания

	setObject($obj, true);
	echo "<div>{$obj->title} - записано</div>";

	//echo ".";
	// sleep(1);
	$counter++;
}
echo "<div>\nОбработано записей - {$counter}\n</div>";
echo "<h1>The End!</h1>";
?>

